FJavieer/stm32l4-modules/test/src/servo_test.c
/******************************************************************************
 *	servo_test.c							      *
 *	2018/dec/05							      *
 ******************************************************************************/


/******************************************************************************
 ******* headers **************************************************************
 ******************************************************************************/
/* Standard C ----------------------------------------------------------------*/
/* Drivers -------------------------------------------------------------------*/
	#include "stm32l4xx_hal.h"

/* libalx --------------------------------------------------------------------*/

/* STM32L4 modules -----------------------------------------------------------*/
	#include "delay.h"
	#include "errors.h"

	#include "servo.h"

	#include "servo_test.h"


/******************************************************************************
 ******* macros ***************************************************************
 ******************************************************************************/


/******************************************************************************
 ******* enums ****************************************************************
 ******************************************************************************/


/******************************************************************************
 ******* structs **************************************************************
 ******************************************************************************/


/******************************************************************************
 ******* variables ************************************************************
 ******************************************************************************/
/* Global --------------------------------------------------------------------*/
/* Static --------------------------------------------------------------------*/


/******************************************************************************
 ******* static functions (prototypes) ****************************************
 ******************************************************************************/
static	int	servo_test_position	(float pos);


/******************************************************************************
 ******* global functions *****************************************************
 ******************************************************************************/
	/**
	 * @brief	Test servos
	 * @return	Error
	 */
int	servo_test_1	(void)
{
	int	i;

	if (servo_init()) {
		return	ERROR_NOK;
	}

	for (i = 00; i <= 90; i+=10) {
		if (servo_test_position(-i)) {
			return	ERROR_NOK;
		}

		if (servo_test_position(0)) {
			return	ERROR_NOK;
		}

		if (servo_test_position(i)) {
			return	ERROR_NOK;
		}

		if (servo_test_position(0)) {
			return	ERROR_NOK;
		}
	}

	return	ERROR_OK;
}

	/**
	 * @brief	Test servos
	 * @return	Error
	 */
int	servo_test_2	(void)
{
	int	i;

	if (servo_init()) {
		return	ERROR_NOK;
	}

	for (i = -90; i <= 90; i+=10) {
		if (servo_test_position(i)) {
			return	ERROR_NOK;
		}
	}

	for (i = 90; i >= -90; i-=10) {
		if (servo_test_position(i)) {
			return	ERROR_NOK;
		}
	}

	return	ERROR_OK;
}


/******************************************************************************
 ******* static functions (definitions) ***************************************
 ******************************************************************************/
static	int	servo_test_position	(float pos)
{
	if (servo_position_set(SERVO_S1, pos)) {
		return	ERROR_NOK;
	}
	if (servo_position_set(SERVO_S2, pos)) {
		return	ERROR_NOK;
	}
	if (servo_position_set(SERVO_S3, pos)) {
		return	ERROR_NOK;
	}
	if (servo_position_set(SERVO_S4, pos)) {
		return	ERROR_NOK;
	}

	if (delay_us(1000000u)) {
		return	ERROR_NOK;
	}

	return	ERROR_OK;
}


/******************************************************************************
 ******* end of file **********************************************************
 ******************************************************************************/
